app/Controllers/AuthController.php

SELECT *
FROM `user`
WHERE `user_email` = 'piera@gmail.com'
 LIMIT 1
---
    public function login($email,$password){
        $User = session();
        $model = new UserModel();
        //$email = $this->request->getVar('email');
        //$password = $this->request->getVar('password');
        $data = $model->where('user_email', $email)->first();